Repository: tayebrhn/ecalendar
Catalog: lib/l10n/app_*.arb
Languages: am

# ethiopianMonth
source: {monthIndex, select, 1 {Meskerem} 2 {Tikimt} 3 {Hidar} 4 {Tahsas} 5 {Tir} 6 {Yekatit} 7 {Megabit} 8 {Miyazya} 9 {Ginbot} 10 {Sene} 11 {Hamle} 12 {Nehase} 13 {Pagumen} other {Invalid month}}
am: {monthIndex, select, 1 {መስከረም} 2 {ጥቅምት} 3 {ኅዳር} 4 {ታኅሣሥ} 5 {ጥር} 6 {የካቲት} 7 {መጋቢት} 8 {ሚያዝያ} 9 {ግንቦት} 10 {ሰኔ} 11 {ሐምሌ} 12 {ነሐሴ} 13 {ጳጉሜ} other {የማይታወቀ ወር}}

# ethiopianWeekday
source: {weekdayIndex, select, 1 {Mon} 2 {Tue} 3 {Wed} 4 {Thur} 5 {Fri} 6 {Sat} 7 {Sun} other {Invalid day}}
am: {weekdayIndex, select, 1 {ሰኞ} 2 {ማክሰኞ} 3 {ረቡዕ} 4 {ሐሙስ} 5 {ዓርብ} 6 {ቅዳሜ} 7 {እሁድ} other {የማይታወቀ ቀን}}

source: Month
am: ወር

# dateConvert
source: Convert Date
am: ቀን ለውጥ

# toGregorian
source: To Gregorian Calendar
am: ወደ ግሪጎሪያን ቀን አቆጣጠር

source: Settings
am: ቅንብሮች

source: Select Language
am: ቋንቋ ምረጥ

# systemTheme
source: Use System Theme
am: የስርዓቱን ገጽታ ተጠቀም

# themeDescription
source: Change based on system theme
am: በስርዓቱ ገጽታ መሰረት ለውጥ

source: Dark Mode
am: ጨለማ ሁነታ

# darkModeDescription
source: Enable dark theme
am: ጨለማ ገጽታን አንቃ

source: About
am: ስለ

# appDescription
source: Ken Mekuteria (የቀን መቁጠሪያ) is an Ethiopian calendar app that displays a full month view alongside the Gregorian calendar.
am: ቀን መቁጠሪያ የኢትዮጵያ ቀን አቆጣጠር መተግበሪያ ሲሆን ሙሉ ወር እይታን ከግሪጎሪያን ቀን አቆጣጠር ጋር አብሮ ያሳያል።

# gitRepo
source: Github Repository
am: ጊት ሀብ ማከማቻ

source: Developer
am: ገንቢ

# viewOpenSourceL
source: View Open-source Licenses
am: ክፍት ምንጭ ፈቃዶችን እይ

# cantOpenLink
source: Could not open link
am: ሊንኩን ማስፈር አልተቻለም

source: Ethiopian Calendar
am: የኢትዮጵያ ቀን አቆጣጠር

source: Gregorian Calendar
am: ግሪጎሪያን ቀን አቆጣጠር

source: Today
am: ዛሬ

source: Select Date
am: ቀን ምረጥ

source: Year
am: ዓመት

source: Day
am: ቀን

source: Current Date
am: የአሁኑ ቀን

source: Converted Date
am: የተለወጠ ቀን

source: Era
am: ዘመን

source: Weekday
am: የሳምንቱ ቀን

source: Month Name
am: የወሩ ስም

source: Year in Ethiopian
am: በኢትዮጵያ ዓመት

source: Year in Gregorian
am: በግሪጎሪያን ዓመት

source: New Year
am: አዲስ ዓመት (እንቁጣጣሽ)

# epiphany
source: Epiphany (Timkat)
am: ጥምቀት

# findingTrueCross
source: Finding of the True Cross (Meskel)
am: መስቀል

# christmas
source: Christmas (Genna)
am: ገና
